# Task 1
# Задан словарь. Напишите программу, которая будет выводить значение по заданному ключу.
# d = {}
# print('Объём словаря:')
# k = int(input())
# for i in range(k):
#     d.update({input(): input()})
# print(d)
# print("Введите ключ:")
# print(d.setdefault(input()))

# Task 2
# Напишите программу, которая будет выполнять действие, обратное заданию 1. Программа должна производить поиск по значению и выдавать ключ.
# d = {}
# print('Объём словаря:')
# k = int(input())
# for i in range(k):
#     d.update({input(): input()})
# print(d)
# list_key = d.keys()
# print("Введите значение:")
# j = input()
# for i in d.items():
#     for c in i:
#         if c == j:
#             print(i[0])

# Task 3
# Напишите программу, которая принимает список строк и выводит количество повторений данных строк в списке.
# d = {}
# print("Len of list:")
# k = int(input())
# # print(k)
# l = []
# for i in range(0, k):
#     l.append(input())
# print(l)
# for j in range(k):
#     d.update({l[j]: l.count(l[j])})
# print(d)
# print(d.values())

